# Выборка
data <- c(1,6,7,1,2,3,9,7,3,6) #МЕНЯЕМ ЗНАЧЕНИЕ!!!





#========================================================================================







# Среднее выборочное
mean_value <- mean(data)
cat("Среднее выборочное:", mean_value, "\n")

# Смещённая выборочная дисперсия
biased_variance <- mean((data - mean_value)^2)
cat("Смещённая выборочная дисперсия:", biased_variance, "\n")

# Несмещённая выборочная дисперсия
unbiased_variance <- var(data) # встроенная функция R для несмещённой дисперсии
cat("Несмещённая выборочная дисперсия:", unbiased_variance, "\n")

#КОД СЧИТАЕТ ВЫБОРОЧНЫЕ ХАРАКТЕРИСТИКИ. МЕТОД МОМЕНТОВ - САМИ.